Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ env.TARGET_URL || 'http://localhost:3000' }}"
  phases:
    # 1. Baseline Load Test (100 VUs constant for 60 seconds)
    - name: Baseline Load Test
      duration: 60
      arrivalCount: 100
    # 2. Stress Test Phase (Ramp-up from 50 to 500 VUs)
    - name: Stress Ramp-up Phase
      duration: 90
      arrivalRate: 5
      rampTo: 50
    # 3. Spike Test Phase (Sudden high-volume surge)
    - name: Sudden Spike Phase
      duration: 15
      arrivalRate: 80
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Gemini Text Summary API Baseline Transaction"
    flow:
      - post:
          url: "/api/gemini/summary"
          json:
            text: "Evaluate standard textbook content for educational summaries."
          expect:
            - statusCode: 200
            - contentType: json
